Revit 2026 API

# RebarShapeDrivenAccessorSetLayoutAsSingle Method

---

Sets the Layout Rule property of rebar set to Single.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetLayoutAsSingle()
```
```vb
Public Sub SetLayoutAsSingle
```
```cpp
public:
void SetLayoutAsSingle()
```
```fsharp
member SetLayoutAsSingle : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This RebarShapeDrivenAccessor doesn't contain a valid rebar reference. |

Only one bar will remain, which is at the position of rebar plane

#### Reference

RebarShapeDrivenAccessor Class

Autodesk.Revit.DB.Structure Namespace